Revit 2026 API

# ColorFillSchemeEntrySetIntegerValue Method

---

Sets new Integer value of entry.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetIntegerValue(
	int value
)
```
```vb
Public Sub SetIntegerValue (
	value As Integer
)
```
```cpp
public:
void SetIntegerValue(
	int value
)
```
```fsharp
member SetIntegerValue :
        value : int -> unit
```

#### Parameters

value Int32

| Exception | Condition |
| --- | --- |
| InvalidOperationException | The entry has different storage type with Integer. |

You should only use this method if the StorageType property reports the type of the entry as a Integer.

#### Reference

ColorFillSchemeEntry Class

Autodesk.Revit.DB Namespace